shelly-tang/YareLampGo_esp32/ESP32_P4_HEAD/pixel_strip.cpp
// SPDX-FileCopyrightText: 2026 LampGo contributors
// SPDX-License-Identifier: GPL-3.0-only

#include "pixel_strip.h"

#include <algorithm>
#include <cmath>
#include <LittleFS.h>

#include "esp32-hal-rmt.h"
#include "esp_heap_caps.h"

namespace {
constexpr uint32_t kRmtFrequency = 10000000;
constexpr uint16_t kFramePeriodMs = 40;
constexpr uint8_t kLegacyRowLengths[] = {47, 49, 51, 51, 51, 51, 51, 49, 47};
constexpr size_t kEffectHeaderBytes = 32;

uint16_t readU16(const uint8_t* data) {
  return data[0] | static_cast<uint16_t>(data[1]) << 8;
}

uint32_t readU32(const uint8_t* data) {
  return data[0] | static_cast<uint32_t>(data[1]) << 8 |
         static_cast<uint32_t>(data[2]) << 16 | static_cast<uint32_t>(data[3]) << 24;
}
}  // namespace

bool PixelStrip::begin() {
  if (!rmtInit(BoardConfig::kLedData, RMT_TX_MODE, RMT_MEM_NUM_BLOCKS_1, kRmtFrequency)) {
    return false;
  }
  rmtSetEOT(BoardConfig::kLedData, LOW);
  queue_ = xQueueCreate(1, sizeof(Command));
  if (!queue_) {
    return false;
  }
  constexpr size_t symbolCount = BoardConfig::kLedCount * 24;
  symbols_ = heap_caps_malloc(symbolCount * sizeof(rmt_data_t), MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
  if (!symbols_) {
    return false;
  }
  clear();
  transmit();
  return xTaskCreate(taskEntry, "led-render", 6144, this, 2, &task_) == pdPASS;
}

void PixelStrip::showMode(uint8_t mode, uint8_t brightness, uint32_t startAtMs) {
  if (!queue_) {
    return;
  }
  Command command{};
  command.type = CommandType::kMode;
  command.mode = static_cast<uint8_t>(std::min<int>(mode, 33));
  command.brightness = static_cast<uint8_t>(
      std::max<int>(1, std::min<int>(brightness, BoardConfig::kLedSafeBrightness)));
  command.loop = true;
  command.startAtMs = startAtMs;
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::playEffect(const char* path, uint8_t fallbackMode, uint8_t brightness, bool loop,
                            uint32_t startAtMs) {
  if (!queue_) return;
  Command command{};
  command.type = CommandType::kEffect;
  command.mode = static_cast<uint8_t>(std::min<int>(fallbackMode, 33));
  command.brightness = static_cast<uint8_t>(
      std::max<int>(1, std::min<int>(brightness, BoardConfig::kLedSafeBrightness)));
  command.loop = loop;
  command.startAtMs = startAtMs;
  strlcpy(command.path, path, sizeof(command.path));
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::showClock(uint8_t hour, uint8_t minute, uint32_t color, uint8_t brightness,
                           uint32_t startAtMs) {
  if (!queue_) return;
  Command command{};
  command.type = CommandType::kClock;
  command.brightness = static_cast<uint8_t>(
      std::max<int>(1, std::min<int>(brightness, BoardConfig::kLedSafeBrightness)));
  command.loop = true;
  command.startAtMs = startAtMs;
  command.color = color;
  command.hour = static_cast<uint8_t>(std::min<int>(hour, 23));
  command.minute = static_cast<uint8_t>(std::min<int>(minute, 59));
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::startOcean(uint32_t color, uint8_t brightness, uint8_t fillPercent,
                            uint16_t sensitivityPercent, uint8_t edgeHighlightPercent,
                            uint16_t tiltPercent, uint16_t impactPercent, uint16_t dampingPercent,
                            uint32_t startAtMs) {
  if (!queue_) return;
  Command command{};
  command.type = CommandType::kOceanStart;
  command.brightness = static_cast<uint8_t>(
      std::max<int>(1, std::min<int>(brightness, BoardConfig::kLedSafeBrightness)));
  command.startAtMs = startAtMs;
  command.color = color;
  command.fillPercent = std::min<uint8_t>(fillPercent, 100);
  command.sensitivityPercent = std::max<uint16_t>(25, std::min<uint16_t>(sensitivityPercent, 200));
  command.edgeHighlightPercent = std::min<uint8_t>(edgeHighlightPercent, 100);
  command.tiltPercent = std::max<uint16_t>(50, std::min<uint16_t>(tiltPercent, 160));
  command.impactPercent = std::min<uint16_t>(impactPercent, 200);
  command.dampingPercent = std::max<uint16_t>(80, std::min<uint16_t>(dampingPercent, 200));
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::updateOcean(float angleDeg, float angularVelocityDps, uint32_t sequence) {
  if (!queue_) return;
  Command command{};
  command.type = CommandType::kOceanInput;
  command.angleTenths = static_cast<int16_t>(
      std::max(-350.0f, std::min(350.0f, angleDeg)) * 10.0f);
  command.velocityTenths = static_cast<int16_t>(
      std::max(-1800.0f, std::min(1800.0f, angularVelocityDps)) * 10.0f);
  command.sequence = sequence;
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::stopOcean(uint32_t startAtMs) {
  if (!queue_) return;
  Command command{};
  command.type = CommandType::kOceanStop;
  command.startAtMs = startAtMs;
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::showTopologyTest(uint8_t brightness, uint32_t startAtMs) {
  if (!queue_) return;
  Command command{};
  command.type = CommandType::kTopologyTest;
  // This is a calibration image, not illumination.  Keep it visibly dim even
  // if a caller accidentally sends a larger brightness value.
  command.brightness = static_cast<uint8_t>(std::max<int>(1, std::min<int>(brightness, 8)));
  command.startAtMs = startAtMs;
  xQueueOverwrite(queue_, &command);
}

void PixelStrip::taskEntry(void* context) {
  static_cast<PixelStrip*>(context)->taskLoop();
}

void PixelStrip::taskLoop() {
  uint32_t phase = 0;
  uint32_t nextFrame = millis();
  uint32_t startAt = 0;
  for (;;) {
    Command command{};
    if (xQueueReceive(queue_, &command, 0) == pdTRUE) {
      if (command.type == CommandType::kOceanInput) {
        // Ignore reordered telemetry so a delayed browser/device packet cannot
        // make the water visibly jump backwards.
        if (command.sequence >= oceanSequence_) {
          oceanAngleDeg_ = static_cast<float>(command.angleTenths) / 10.0f;
          oceanAngularVelocityDps_ = static_cast<float>(command.velocityTenths) / 10.0f;
          oceanSequence_ = command.sequence;
        }
      } else {
        mode_ = command.mode;
        brightness_ = command.brightness;
        effectActive_ = command.type == CommandType::kEffect && openEffect(command.path, command.loop);
        clockActive_ = command.type == CommandType::kClock;
        topologyTestActive_ = command.type == CommandType::kTopologyTest;
        oceanActive_ = command.type == CommandType::kOceanStart;
        if (clockActive_) {
          clockHour_ = command.hour;
          clockMinute_ = command.minute;
          clockColor_ = command.color;
        }
        if (oceanActive_) {
          oceanColor_ = command.color;
          oceanFillPercent_ = command.fillPercent;
          oceanSensitivityPercent_ = command.sensitivityPercent;
          oceanEdgeHighlightPercent_ = command.edgeHighlightPercent;
          oceanTiltPercent_ = command.tiltPercent;
          oceanImpactPercent_ = command.impactPercent;
          oceanDampingPercent_ = command.dampingPercent;
          oceanAngleDeg_ = 0.0f;
          oceanAngularVelocityDps_ = 0.0f;
          oceanSequence_ = 0;
        }
        if (command.type == CommandType::kOceanStop) {
          mode_ = 0;
          brightness_ = 1;
        }
        startAt = command.startAtMs;
        phase = 0;
        nextFrame = std::max(millis(), startAt);
      }
    }
    const uint32_t now = millis();
    if (static_cast<int32_t>(now - nextFrame) >= 0 && static_cast<int32_t>(now - startAt) >= 0) {
      if (topologyTestActive_) {
        renderTopologyTest();
      } else if (clockActive_) {
        renderClock(phase++);
      } else if (oceanActive_) {
        renderOcean(phase++);
      } else if (effectActive_) {
        renderEffect(phase++);
        if (!effectLoop_ && phase >= effectTicks_) effectActive_ = false;
      } else {
        render(mode_, phase++);
      }
      transmit();
      nextFrame = now + kFramePeriodMs;
    }
    vTaskDelay(pdMS_TO_TICKS(4));
  }
}

