shelly-tang/YareLampGo_esp32/ESP32_P4_HEAD/pixel_strip.cpp
void PixelStrip::transmit() {
  constexpr size_t symbolCount = BoardConfig::kLedCount * 24;
  auto* symbols = static_cast<rmt_data_t*>(symbols_);
  if (!symbols) return;

  uint32_t channelSum = 0;
  for (const auto& pixel : pixels_) {
    channelSum += (static_cast<uint32_t>(pixel[0]) + pixel[1] + pixel[2]) * brightness_ / 255U;
  }
  const uint32_t budget = BoardConfig::kLedEquivalentWhiteBudget * 3U * 255U;
  const uint32_t scale = channelSum > budget ? (budget * 65535U / channelSum) : 65535U;

  size_t symbol = 0;
  for (const auto& pixel : pixels_) {
    const uint8_t ordered[3] = {pixel[1], pixel[0], pixel[2]};  // GRB
    for (uint8_t source : ordered) {
      const uint8_t value = static_cast<uint32_t>(source) * brightness_ * scale / (255U * 65535U);
      for (int bit = 7; bit >= 0; --bit) {
        const bool one = value & (1U << bit);
        symbols[symbol].level0 = 1;
        symbols[symbol].duration0 = one ? 8 : 4;
        symbols[symbol].level1 = 0;
        symbols[symbol].duration1 = one ? 4 : 8;
        ++symbol;
      }
    }
  }
  rmtWrite(BoardConfig::kLedData, symbols, symbolCount, 50);
}

void PixelStrip::clear() {
  memset(pixels_, 0, sizeof(pixels_));
}

void PixelStrip::setPixel(int row, int column, uint8_t red, uint8_t green, uint8_t blue) {
  if (row < 0 || row >= BoardConfig::kLedHeight || column < 0 || column >= BoardConfig::kLedWidth) {
    return;
  }
  // The panel is row-serpentine.  Its front-facing origin is calibrated with
  // renderTopologyTest(); mirror controls remain the only board-specific
  // transform instead of leaking orientation assumptions into renderers.
  const int logicalRow = BoardConfig::kLedMirrorY ? BoardConfig::kLedHeight - 1 - row : row;
  const int logicalColumn = BoardConfig::kLedMirrorX ? BoardConfig::kLedWidth - 1 - column : column;
  const int physicalColumn = (logicalRow & 1) ? BoardConfig::kLedWidth - 1 - logicalColumn : logicalColumn;
  setPixelPhysical(logicalRow * BoardConfig::kLedWidth + physicalColumn, red, green, blue);
}

void PixelStrip::setPixelPhysical(int index, uint8_t red, uint8_t green, uint8_t blue) {
  if (index < 0 || index >= BoardConfig::kLedCount) {
    return;
  }
  pixels_[index][0] = red;
  pixels_[index][1] = green;
  pixels_[index][2] = blue;
}

uint32_t PixelStrip::wheel(uint8_t value) {
  value = 255 - value;
  if (value < 85) return ((255 - value * 3) << 16) | (value * 3);
  if (value < 170) {
    value -= 85;
    return (value * 3 << 8) | (255 - value * 3);
  }
  value -= 170;
  return (value * 3 << 16) | ((255 - value * 3) << 8);
}
